package ru.maslov.t1.task1.runners;

import java.math.BigDecimal;

public class Runner {
    public static void main(String[] args) {
        /**
         * Написать программу, которая читает из файла информацию о
         * сотрудниках и их принадлежности к отделам, рассчитывает
         * среднюю зарплату сотрудников в отделе, строит и выводит в
         * файл все варианты возможных переводов сотрудников из одного
         * отдела в другой, при которых средняя зарплата отдела увеличивается
         * в обоих отделах.
         */
//        BigDecimal
        System.out.println("Hello");
    }
}
